app/controllers/ads_controller.rb

SELECT * FROM `plaggs` WHERE (approved=0) ORDER BY created_at DESC LIMIT 0, 30
---
   def index
    @ads = Plagg.paginate(:page => params[:page], :conditions => "approved=0", :order => "created_at DESC")

SELECT * FROM `contents` WHERE (`contents`.`id` = 2)
---
      def edit
         $title = "Editing the content details"
         @content = Content.find(params[:id])