app/controllers/brand_names_controller.rb

SELECT * FROM `brands` WHERE (name LIKE 'l%')
---
  def index
    if params[:q]
      @brands = Brand.find(:all,:conditions => ["name LIKE ?", "#{params[:q]}%"])