app/controllers/categories_controller.rb

SELECT * FROM `categories` ORDER BY created_at DESC LIMIT 0, 30
SELECT * FROM `departments` ORDER BY weight DESC
SELECT count(*) AS count_all FROM `categories`
---
  def index
    if (params[:department_id])
      @categories = Category.all(:conditions => { :department_id => params[:department_id] })
    else
      @categories = Category.paginate(:page => params[:page], :order => "created_at DESC", :include => :department)