app/controllers/departments_controller.rb

SELECT * FROM `departments` ORDER BY created_at DESC, weight DESC LIMIT 0, 30
---
  def index
    @departments = Department.paginate(:page => params[:page], :order => "created_at DESC")

SELECT * FROM `sizes`
---
  def show
    if params[:filter]
      if params[:filter][:tags]
        tags  = params[:filter][:tags].map  { |i| i.to_i } .select { |i| i > 0 }
        session[:filter][:tags] = tags
      else
        session[:filter][:tags] = []
      end
      if params[:filter][:sizes]
        sizes = params[:filter][:sizes].map { |i| i.to_i } .select { |i| i > 0 }

SELECT * FROM `tags` WHERE (`tags`.`group` = 2)
---
      args.push true
    end

    if !session[:filter][:tags].empty?
     condition = nil
	      seasons = Tag.all(:conditions => [ "id IN (?) and `group` = 2 ", session[:filter][:tags]])#, :select => "tag_id").map(&:tag_id)

SELECT * FROM `plaggs` WHERE (department_id = 2) ORDER BY created_at DESC LIMIT 0, 8
SELECT `assets`.* FROM `assets` WHERE (`assets`.plagg_id IN (67,66,60,59,58,54,53,47))
SELECT count(*) AS count_all FROM `plaggs` WHERE (department_id = 2)
---
    @location = session[:filter][:location]
    @brand = session[:filter][:brand_name]

    @plaggs = Plagg.paginate(:conditions => conditions, :page => params[:page], :per_page => per_page, :order => "created_at DESC", :include => [ :assets, :user ])

SELECT * FROM `departments` WHERE (`departments`.`id` = 2) ORDER BY weight DESC
---
  def find_department
    @department = Department.find(params[:id])