app/controllers/notifications_controller.rb

  def unseen
    offer_count = Offer.count(:conditions => [ "receiver_id = ? AND received_at IS NOT ? AND viewed_at IS ? AND accepted_at IS ?", current_user.id, nil, nil,nil ])
    watching_count = Watching.all(:conditions => [ "watcher_id = ?", current_user.id ], :select => :new_unseen).inject(0) do |sum, w|
---
SELECT max(`offers`.updated_at) AS max_updated_at FROM `offers` WHERE ((receiver_id = 14 AND received_at IS NOT NULL AND viewed_at IS NULL AND accepted_at IS NULL) OR ( sender_id = 14 AND accepted_at IS NOT NULL AND viewed_at IS NULL) )
SELECT max(`watchings`.updated_at) AS max_updated_at FROM `watchings` WHERE (watcher_id = 14 and new_unseen > 0)
SELECT new_unseen FROM `watchings` WHERE (watcher_id = 14)