app/controllers/offers_controller.rb

  def create
    plagg = Plagg.find(params[:offer][:plagg_id])
---
SELECT * FROM `plaggs` WHERE (brand_name NOT LIKE'NULL') GROUP BY brand_name