app/controllers/plaggs_controller.rb

SELECT * FROM `plaggs` WHERE (brand_name NOT LIKE'NULL') GROUP BY brand_name
SELECT * FROM `sizes`
---
  def index
    #~ render :text => session[:user] and return
    if request.post? && params[:query]
      if authorized?
        @plaggs = Plagg.search(params[:query])
      else
        @plaggs = Plagg.search(params[:query], :conditions => { :approved => true })
      end
    elsif params[:filter]
      if params[:filter][:tags]
        tags  = params[:filter][:tags].map  { |i| i.to_i } .select { |i| i > 0 }
        session[:filter][:tags] = tags
      else
        session[:filter][:tags] = []
      end
      if params[:filter][:sizes]
        sizes = params[:filter][:sizes].map { |i| i.to_i } .select { |i| i > 0 }

SELECT * FROM `tags` WHERE (`tags`.`group` = 2)
---
      args.push true
    end

    if !session[:filter][:tags].empty?
	      #~ condition = nil
	      seasons = Tag.all(:conditions => [ "id IN (?) and `group` = 2 ", session[:filter][:tags]])#, :select => "tag_id").map(&:tag_id)

SELECT * FROM `plaggs` WHERE (category_id != 24 AND approved = 1) ORDER BY created_at DESC LIMIT 0, 8
SELECT `assets`.* FROM `assets` WHERE (`assets`.plagg_id IN (67,66,65,64,63,62,61,60))
SELECT count(*) AS count_all FROM `plaggs` WHERE (category_id != 24 AND approved = 1)
---
    @sel_sizes = session[:filter][:sizes]
    @location = session[:filter][:location]
    @brand= session[:filter][:brand_name]
    @plaggs = Plagg.paginate(:conditions => conditions, :page => params[:page], :per_page => per_page, :order => "created_at DESC", :include => [ :assets, :user ])

SELECT * FROM `categories` WHERE (`categories`.`id` = 2)
SELECT * FROM `departments` WHERE (`departments`.`id` = 1) ORDER BY weight DESC
SELECT * FROM `plaggs` WHERE (brand_name NOT LIKE'NULL') GROUP BY brand_name
SELECT * FROM `sizes` WHERE (`sizes`.`id` = 1)
SELECT * FROM `comments` WHERE (commentable_id = 56 AND commentable_type = 'Plagg')
SELECT * FROM `departments` ORDER BY weight DESC
SELECT `tags`.* FROM `tags` INNER JOIN `taggings` ON `tags`.id = `taggings`.tag_id WHERE ((`taggings`.plagg_id = 56))
---
  def show
    @plagg = Plagg.find(params[:id], :include => [ :department, :category, :user, :size, :assets ])
    @comments = Comment.all(:conditions => [ "commentable_id = ? AND commentable_type = ?", @plagg.id, "Plagg" ], :include => :user)
    @comment = @plagg.comments.new if logged_in?
    unless @plagg.approved?
      raise ActiveRecord::RecordNotFound unless logged_in? && (@plagg.user == current_user || authorized?)
      flash[:notice] = "This Plagg will not be publicly viewable until an admin approves it." if flash[:notice].blank?
    end

    tags = @plagg.tags.partition { |tag| tag.group == Tag::Group::CONDITION }