app/controllers/posts_controller.rb

  def index
    @posts = Post.paginate(:page => params[:page], :order => "created_at DESC")
---
SELECT * FROM `posts` ORDER BY created_at DESC LIMIT 0, 30

  def show
    @comments = Comment.all(:conditions => [ "commentable_id = ? AND commentable_type = ?", @post.id, "Post" ], :include => :user)
---
SELECT * FROM `comments` WHERE (commentable_id = 62 AND commentable_type = 'Post')

  def create
      require 'iconv'
      require 'unicode'
    str=  params[:post][:title]
      str = no_accents(str)
      #~ s = ((translation_to && translation_from) ? Iconv.iconv(translation_to, translation_from, str ) : str ).to_s
    render :text=>str and return
    @post = Post.new(params[:post])
    @post.user = current_user
    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`image_file_size`, `updated_at`, `image_3_file_name`, `body_html`, `title`, `image_3_file_size`, `body`, `image_content_type`, `body1`, `image_3_content_type`, `content`, `image_2_file_name`, `perma_link`, `user_id`, `image_2_file_size`, `body1_html`, `created_at`, `image_file_name`, `image_2_content_type`) VALUES(NULL, '2010-05-21 07:28:59', NULL, '<p></p>', 'vote èspo è spo èspo èspodasdadad', NULL, '', NULL, NULL, NULL, 'asdadads', NULL, 'vote-spo-spo-spo-spodasdadad', 14, NULL, NULL, '2010-05-21 07:28:59', NULL, NULL)

  def destroy
    @post.destroy
---
DELETE FROM `posts` WHERE `id` = 69

  def find_post
    @post = Post.find_by_perma_link(params[:id])
---
SELECT * FROM `posts` WHERE (`posts`.`perma_link` = 'vote-spo-spo-spo-spodasdadad') LIMIT 1