app/controllers/sessions_controller.rb

def forgot_password
     $title = "Plaggs Forgot Password Page"

     if request.post?
          user = User.find(:first, :conditions => ["email_address LIKE ?",params[:session][:email_address]]) || user = User.find(:first, :conditions => ["username LIKE ?",params[:session][:username]])


          if user
            random_password = User.random_password(8)
            token = User.random_password(10)
            user.update_attributes(:security_token => token)
---
SELECT `users`.id FROM `users` WHERE (LOWER(`users`.`email_address`) = BINARY 'swaminadhan_nyros@yahoo.com' AND `users`.id <> 36) LIMIT 1
UPDATE `users` SET `security_token` = '3TVqZZ0NdU', `updated_at` = '2010-05-25 06:42:10' WHERE `id` = 36