app/controllers/sizes_controller.rb

  def index
    if (params[:category_id])
      category = Category.find_by_id(params[:category_id])
      @sizes = category.nil? ? [] : category.sizes
    else
      @sizes = Size.all
---
SELECT * FROM `sizes`