app/controllers/users_controller.rb

  def show
    conditions = "user_id = ?"
    args = [ @user.id ]

    unless authorized?
      conditions += " AND approved = ?"
      args.push true
    end

    conditions = [ conditions ] + args

    @plaggs = Plagg.paginate(:conditions => conditions, :page => params[:page], :order => "created_at DESC", :include => :department)
---
SELECT * FROM `departments` ORDER BY weight DESC
SELECT * FROM `plaggs` WHERE (user_id = 38 AND approved = 1) ORDER BY created_at DESC LIMIT 0, 30

  def new
    @user = User.new
    @networks=Network.all
---
SELECT * FROM `networks`

  def create
    @user = User.new(params[:user])
    @user.role = params[:user][:role] if authorized?

    respond_to do |format|
      if  verify_recaptcha(:model => @user) && @user.save
---
INSERT INTO `users` (`city`, `avatar_updated_at`, `updated_at`, `avatar_file_name`, `avatar_file_size`, `profile`, `fb_email_hash`, `county`, `username`, `role`, `phone_number`, `security_token`, `remember_token_expires_at`, `gender`, `fb_user_id`, `avatar_content_type`, `password_hash`, `remember_token`, `confirmation_token`, `email_address`, `created_at`, `remember_token1`) VALUES('', '2010-05-25 06:53:50', '2010-05-25 06:53:51', 'planets.gif', 4226, 'Software engineer', NULL, 'kakinada', 'sharma', 0, '123467980', NULL, NULL, 1, NULL, 'image/gif', '$2a$10$VWra0HM.SD8o6wj8QN8GW.hZprjcxqJQKG5Xldjux3oh4oDR5vTQe', NULL, '2c0b036b53d8db4fadcae3b1132186f250744a3a27dfee76f5566703e6be6492', 'sharma_nyros@yahoo.com', '2010-05-25 06:53:51', NULL)

  def find_user
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1